package lessonExamples.adapter;


/*
Структурный шаблон
Преобразование интерфейса одного класса в интерфейс другого класса, который необходим клиенту

Используется для обеспечения совместной работы классов, интерфейсы которых несовместимы

Примеры использования:
- интерфейс класса, который мы хотим использоваться не соответствует нашим потребностям,
- необходим класс, который должен взаимодействовать с классами, которые ему неизвесты или не связаны с ним
- необходимо использовать несколько существующих подклассов, но нецелесообразно использовать методы этих классов создавая их новые подклассы
 */
public class Adapter {

}
