package lessonExamples.creationalPatterns.builder;

public class Main {
    public static void main(String[] args) {
        /*
        Цель: отделить конструирование сложного объекта от его представления таким образом,
        чтобы в результате одного и того же конструирования мы могли получить разные представления

         Используется для создания различных объектов из одного наборад данных

         Пример использования:
         - порядок создания сложного объекта не должен зависить от того, из каких частей состои объект
         и того, как эти объекты взаимосвязанны.
         - процесс конструирования объекта должен представлять различные представления объекта, который мы конструируем
         */
    }
}
